driver-tests/bpelse/nmproperty/FromToPropertySpec/src/propAliasSyntax/parentservice.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="parentservice" targetNamespace="http://j2ee.netbeans.org/wsdl/parentservice"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/parentservice" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="parentserviceOperationRequest">
        <part name="part1" type="xsd:string"/>
        <part name="part2" type="xsd:int"/>
    </message>
    <message name="parentserviceOperationResponse">
        <part name="part1" type="xsd:string"/>
        <part name="part2" type="xsd:int"/>
    </message>
    <portType name="parentservicePortType">
        <operation name="parentserviceOperation">
            <input name="input1" message="tns:parentserviceOperationRequest"/>
            <output name="output1" message="tns:parentserviceOperationResponse"/>
        </operation>
    </portType>
    <binding name="parentserviceBinding" type="tns:parentservicePortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="parentserviceOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/parentservice"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/parentservice"/>
            </output>
        </operation>
    </binding>
    <service name="parentserviceService">
        <port name="parentservicePort" binding="tns:parentserviceBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/parentserviceService/parentservicePort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="parentservice">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="parentservicePortTypeRole" portType="tns:parentservicePortType"/>
    </plnk:partnerLinkType>
</definitions>
