driver-tests/bpelse/nmproperty/FromToPropertySpecJBI/test/failingSoapTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:par="http://j2ee.netbeans.org/wsdl/parentservice">
  <soapenv:Header>
      <sht:HeaderElement xmlns:sht="http://soap-header-test">
          soap header value
      </sht:HeaderElement>
  </soapenv:Header>
  <soapenv:Body>
    <par:parentserviceOperation>
      <part1>Hello</part1>
      <part2>2</part2>
    </par:parentserviceOperation>
  </soapenv:Body>
</soapenv:Envelope>